import 'package:aurudu_nakath/features/ui/help/data/modals/help_topic.dart';
import 'package:aurudu_nakath/features/ui/help/data/repositories/help_repository.dart';

class HelpRepositoryImpl implements HelpRepository {
  @override
  List<HelpTopic> getHelpTopics() {
    return [
      HelpTopic(
        title: 'ඇප් එක භාවිතා කරන්නේ කොහොමද?',
        description: '''
**මෙම ඇප් එක භාවිතා කිරීමට:**

- **ඔබගේ අන්තර්ජාල සබදතාව ක්‍රියාත්මක වී තිබිය යුතුය:** 
  ඔබට මෙම ඇප් එක භාවිතා කිරීම සඳහා ස්ථිර අන්තර්ජාල සබදතාවක් අවශ්‍ය වේ.

- **ප්‍රවේශවීම සඳහා ඇප් එකේ නවීනම අනුවාදය භාවිතා කරන්න:** 
  නවීනම අනුවාදය භාවිතා කිරීමෙන් ඔබට නවතම සංවර්ධන හා විශේෂාංග ලබා ගත හැකිය.



**මාලිමාව භාවිතා කිරීමට:**
- **මාලිමාව භාවිතා කිරීම සඳහා ඔබගේ දුරකතනයේ Sensor සදහා අවසර ලබා දිය යුතුයි:** 
  මෙවලම් හී ඇති මාලිමාව මත ක්ලික් කිරීමෙන් මාලිමාව ලබාගත හැක.

**මෙම ඇප් එක ගැන අමතර සහාය සඳහා, කරුණාකර අපගේ විශේෂ සහාය කණ්ඩායමේ අමතන්න.**

'''

,
      ),
      HelpTopic(
        title: 'හෙළ AI භාවිතය',
        description: '''
**හෙළ AI භාවිතා කරන්නේ කොහොමද?**

- **හෙළ AI යනු කුමක්ද?:** 
  හෙළ AI යනු, ඔබගේ කාර්ය සපුරාලීමේදී සහ උපකාර කිරීමේදී ඔබට ආධාර කරන නව තාක්ෂණික උපකරණයකි. 

- **උපයෝගීත්වය:**
  - **භාෂාවන්:** හෙළ AI භාෂා සහකාර ලෙස ක්‍රියා කර, ඔබට ප්‍රශ්න වලට පිළිතුරු ලබා දීමට හා විවිධ භාෂාවන් මැද සංවාද කිරීමට හැකියාව සපයයි.
  - **යාවත්කාලීන කිරීම:** ඔබගේ දත්ත, කාර්ය, හෝ ආරක්ෂාව සම්බන්ධයෙන් යාවත්කාලීන කිරීම් ලබා දිය හැකිය.

- **සියලු විශේෂාංග භාවිතා කරන්න:** 
  හෙළ AI වෙත සම්බන්ධ වීමෙන්, ඔබට විශේෂාංග සඳහා ප්‍රවේශ ලබා ගත හැකිය.

**ඉහත විශේෂාංගයන් සම්බන්ධයෙන් වැඩිදුර විස්තර සඳහා, අපගේ විශේෂ සහාය කණ්ඩායමේ අමතන්න.**
''',
      ),
      HelpTopic(
        title: 'අප හා සම්බන්ද වන්න',
        description: '''
**අපව හා සම්බන්ද වන්න:**

- **දුරකථන අංකය:** 0762938664
- **ඊ-මේල්:** nimanthaperera2001@gmail.com
- **සමාගම:** LankaTech Innovations

**අපගේ සේවාවන් ගැන වැඩිදුර විස්තර ලබා ගැනීමට හෝ ඔබට අවශ්‍ය සහාය සඳහා, කරුණාකර ඉහත විශේෂාංග භාවිතා කරන්න.**
''',
      ),
      HelpTopic(
        title: 'නිර්මාණය',
        description: '''
**මෙම ඇප් එක නිර්මාණය කිරීම:**

- **සමාගම:** LankaTech Innovations
- **තීරණාත්මක කණ්ඩායම:** 
  අපගේ කණ්ඩායම සහ විශේෂඥයන්ගේ කටයුතු මඟින් මෙම ඇප් එක නිර්මාණය කරනු ලැබිය.
- **අමතර විස්තර:** 
  අපගේ කණ්ඩායම සහ නවෝත්පාදන කණ්ඩායම සෑම මොහොතකම නවීන තාක්ෂණයන් සහ පාරිභෝගික අවශ්‍යතා සඳහා අදාළ විසඳුම් සැලසීමට කැපවී සිටී.

**මෙම ඇප් එක පිළිබඳව වැඩිදුර තොරතුරු හෝ ඔබට අවශ්‍ය විශේෂාංග සඳහා, අපගේ සහාය කණ්ඩායමේ අමතන්න.**
''',
      ),
    ];
  }
}
